---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.AntiparallelRampRisers
source: html/99eefc34-deb6-f995-5af2-943cf4ddc7df.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.AntiparallelRampRisers Property

Riser lines are parallel but not collinear. Can't build Run between these Risers.

## Syntax (C#)
```csharp
public static FailureDefinitionId AntiparallelRampRisers { get; }
```